# Analytical Procedures

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.sql import text

In [2]:
conn_url = 'postgresql://postgres:123@localhost:5432/apan5310termproject'
engine = create_engine(conn_url)
connection = engine.connect()

### 1. Who Are Our Most Recent Hires? Return the full name.

In [3]:
query = text("""
SELECT employee_id, first_name || ' ' || last_name as full_name, hire_date
FROM employees
ORDER BY hire_date DESC
LIMIT 5;
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

   employee_id            full_name   hire_date
0    417133061    Lezley Addionizio  2022-12-14
1    348107360       Norby Crighton  2022-12-01
2    328873763  Sylvester Logesdale  2022-11-25
3    703004880         Evan Volkers  2022-11-10
4    567755836       Drucy Bucknall  2022-07-29

### 2. Which Products Need Re-Ordering from Suppliers? Assuming a re-ordering threshold of less than 10 units.

In [4]:
query = text("""
SELECT inventory.product_id, product_name, category_name, quantity
FROM inventory
JOIN product_categories ON inventory.category_id = product_categories.category_id
WHERE quantity < 10;
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

,product_id,product_name,category_name,quantity
0,6,RSPCA Approved Chicken Breast Fillet Crumb Sag...,Crumbed chicken,5
1,8,RSPCA Approved Chicken Burgers Plain Crumb,Crumbed chicken,8
2,11,Beef 3 Star Regular Mince,Beef & veal mince,2
3,12,Beef 4 Star Lean Mince,Beef & veal mince,9
4,19,Beef 4 Star Lean Mince,Beef & Veal Mince,9
...,...,...,...,...
289,999,Brioche Swirls With Choc Chips,Sweet Brioche,7
290,1001,Spread,Family favourites,4
291,1012,Whole Grain Energy & Fibre Milo Cereal Family ...,Family favourites,2
292,1015,Hazelnut Spread With Cocoa,Family favourites,9
293,1018,Mighty Grain Cereal,Family favourites,6

### 3. Total sales for each store, including the store address and store name

In [5]:
query = text("""
SELECT stores.store_id, store_address, SUM(total_price) as total_sales
FROM sales
JOIN stores ON sales.store_id = stores.store_id
GROUP BY stores.store_id, store_address;
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

   store_id       store_address total_sales
0         2  31-28 Ditmars Blvd   701834.00
1         1      84-01 37th Ave   811220.00

### 4. What are the top 10 employees with the highest total sales? including their names, roles, and the store they work at.

In [6]:
query = text("""
SELECT employees.employee_id, first_name, last_name, role, stores.store_id, SUM(total_price) as total_sales
FROM sales
JOIN employees ON sales.employee_id = employees.employee_id
JOIN stores ON sales.store_id = stores.store_id
GROUP BY employees.employee_id, first_name, last_name, role, stores.store_id
ORDER BY total_sales DESC
LIMIT 10;
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

,employee_id,first_name,last_name,role,store_id,total_sales
0,222129522,Ephrem,Bastable,manager,1,60982.00
1,268492923,Felicdad,Melross,manager,2,55839.00
2,214554896,Delmor,Di Matteo,sales,2,54472.00
3,579267444,Vaughn,Mouser,manager,2,51338.00
4,816789963,Arliene,Sillis,sales,1,47925.00
5,442422109,Juliana,Yarnton,assistant store manager,2,44747.00
6,143166420,Susan,Eeles,assistant store manager,2,44420.00
7,193778923,Beilul,Loveredge,sales,2,43499.00
8,93539360,Thor,Markos,sales,1,43466.00
9,968409652,Sephira,Buckle,sales,2,42075.00

### 5. What are the total quantity of products delivered by each supplier?

In [7]:
query = text("""
SELECT suppliers.supplier_id, supplier_company_name, COUNT(deliveries.product_id) as total_products_supplied, SUM(deliveries.quantity) as total_quantity_delivered
FROM deliveries
JOIN inventory ON deliveries.product_id = inventory.product_id
JOIN suppliers ON deliveries.supplier_id = suppliers.supplier_id
GROUP BY suppliers.supplier_id, supplier_company_name;
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

,supplier_id,supplier_company_name,total_products_supplied,total_quantity_delivered
0,652,Bergnaum-Larson,1,3
1,273,Kertzmann,1,25
2,51,Bogan,1,1
3,1091,Stoltenberg and Pfannerstill,1,9
4,951,Luettgen,1,8
...,...,...,...,...
1183,64,White and Rodriguez,1,11
1184,55,Bosco,1,2
1185,148,Feest LLC,1,30
1186,790,Halvorson-Ruecker,1,23
1187,828,Johnson and Pfeffer,1,7

### 6. What are the top 5 products with the highest quantity sold? Including their product names and categories.

In [8]:
query = text("""
SELECT inventory.product_id, product_name, category_name, SUM(sales.quantity) as total_quantity_sold
FROM sales
JOIN inventory ON sales.product_id = inventory.product_id
JOIN product_categories ON inventory.category_id = product_categories.category_id
GROUP BY inventory.product_id, product_name, category_name
ORDER BY total_quantity_sold DESC
LIMIT 5;
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

,product_id,product_name,category_name,total_quantity_sold
0,753,Sugar Snap Peas Prepacked,Peas,32
1,754,Sugar Snap Peas Prepacked,beans & okra,32
2,574,New Zealand King Salmon Manuka Wood Smoked Slices,Prepacked seafood,32
3,876,Original Bocconcini Cheese,Haloumi & bocconcini,32
4,540,Lamb Boneless Shank Meat,Lamb shanks,32

### 7. What are the total sales and total orders for each customer?Including their names and email addresses

In [9]:
query = text("""
SELECT customers.customer_id, first_name, last_name, email, COUNT(order_id) as total_orders, SUM(total_price) as total_spent
FROM customer_orders
JOIN customers ON customer_orders.customer_id = customers.customer_id
GROUP BY customers.customer_id, first_name, last_name, email;
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

,customer_id,first_name,last_name,email,total_orders,total_spent
0,652,Alexandro,Fallanche,afallanche8t@joomla.org,1,1123.00
1,273,Laurent,Keetley,lkeetleyf9@e-recht24.de,1,1167.00
2,51,Charlie,Gallant,cgallant2p@miibeian.gov.cn,1,545.00
3,951,Uri,Selliman,usellimanpe@tamu.edu,1,2048.00
4,839,Tiffany,Hellewell,thellewellix@sitemeter.com,1,2202.00
...,...,...,...,...,...,...
995,64,Britni,Joll,bjoll3h@answers.com,1,889.00
996,55,Sephira,Friedank,sfriedank2v@comcast.net,1,969.00
997,148,Olvan,Antonikov,oantonikov7p@youtube.com,1,862.00
998,790,Drake,Bispham,dbisphamg7@163.com,1,1483.00
999,828,Geoffrey,Schoolfield,gschoolfieldih@admin.ch,1,1250.00

### 8. Total revenue generated by each store, including the store address.

In [10]:
query = text("""
SELECT stores.store_id, store_address, SUM(total_price) as total_revenue
FROM sales
JOIN stores ON sales.store_id = stores.store_id
GROUP BY stores.store_id, store_address;
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

   store_id       store_address total_revenue
0         2  31-28 Ditmars Blvd     701834.00
1         1      84-01 37th Ave     811220.00

### 9. Top 5 customers who made the most orders, including their names, email addresses, and the total number of orders.

In [11]:
query = text("""
SELECT customers.customer_id, first_name, last_name, email, COUNT(order_id) as total_orders
FROM customers
JOIN customer_orders ON customers.customer_id = customer_orders.customer_id
GROUP BY customers.customer_id, first_name, last_name, email
ORDER BY total_orders DESC
LIMIT 5;
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

   customer_id first_name  last_name                       email  total_orders
0          273    Laurent    Keetley     lkeetleyf9@e-recht24.de             1
1           51    Charlie    Gallant  cgallant2p@miibeian.gov.cn             1
2          951        Uri   Selliman        usellimanpe@tamu.edu             1
3          839    Tiffany  Hellewell  thellewellix@sitemeter.com             1
4          652  Alexandro  Fallanche     afallanche8t@joomla.org             1

### 10. List all employees who have sold more than a specific number of products (for example, 10) in a given month (for example, Jun 2020), including their names, roles, and the total number of products sold.

In [12]:
# Query: Employees who sold more than a specific number of products in a given month
year = 2020
month = 6
threshold_products = 10
query = text(f"""
SELECT employees.employee_id, first_name, last_name, role, SUM(sales.quantity) as total_products_sold
FROM sales
JOIN employees ON sales.employee_id = employees.employee_id
WHERE EXTRACT(YEAR FROM date) = {year} AND EXTRACT(MONTH FROM date) = {month}
GROUP BY employees.employee_id, first_name, last_name, role
HAVING SUM(sales.quantity) > {threshold_products};
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

,employee_id,first_name,last_name,role,total_products_sold
0,77073752,Amalle,Snowball,assistant store manager,29
1,93539360,Thor,Markos,sales,37
2,193778923,Beilul,Loveredge,sales,22
3,268492923,Felicdad,Melross,manager,22
4,750928246,Janeva,Crossan,manager,52
5,816789963,Arliene,Sillis,sales,19
6,903857058,Gillan,Giacoppo,manager,28

### 11. List the total sales of each product category in a specific time range (for example, 2022-01-01 to 2023-04-29), including the category names and total sales amounts.

In [13]:
# Query: Total sales of each product category in a specific time range
start_date = '2022-01-01'
end_date = '2023-04-29'
query = text(f"""
SELECT product_categories.category_id, category_name, SUM(sales.quantity * sales.total_price) as total_sales_amount
FROM sales
JOIN inventory ON sales.product_id = inventory.product_id
JOIN product_categories ON inventory.category_id = product_categories.category_id
WHERE sales.date BETWEEN '{start_date}' AND '{end_date}'
GROUP BY product_categories.category_id, category_name;
""")

result = connection.execute(query)

df = pd.DataFrame(result, columns=result.keys())

# Print the result
df

    category_id              category_name total_sales_amount
0             1              Chicken offal           28842.00
1            19                     Apples           41232.00
2            23                 Lamb mince           47906.00
3            32                  Mandarins           26999.00
4            46        Capsicum & chillies           17514.00
5            52            Garlic & ginger            3240.00
6            53                   Potatoes           67538.00
7            61                    Pumpkin           24596.00
8            67             Milk flavoured           11056.00
9            72     Cheddar & tasty cheese            2864.00
10           74         Brie & soft cheese            6312.00
11           81       Haloumi & bocconcini           22344.00
12           91  Multigrain & Seeded Bread           10656.00
13           99                  On the go           36092.00
14          101          Family favourites           21660.00

### 12. Average working hours each store

In [14]:
stmt = """
SELECT es.store_id, ROUND(AVG(EXTRACT(EPOCH FROM (es.end_time - es.start_time)) / 3600), 2) AS avg_working_hours
FROM employee_shifts es
JOIN employees e ON es.employee_id = e.employee_id
GROUP BY es.store_id;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

   store_id avg_working_hours
0         1             10.03
1         2             10.01

### 13. What is the most popular items in each stores?

In [15]:
stmt = """
SELECT store_id, product_name, total_sales
FROM (
SELECT s.store_id, i.product_id, i.product_name, SUM(s.total_price) AS total_sales,
ROW_NUMBER() OVER (PARTITION BY s.store_id ORDER BY SUM(s.total_price) DESC) AS rn
FROM sales s
JOIN inventory i ON s.product_id = i.product_id
GROUP BY s.store_id, i.product_id, i.product_name
) subquery
WHERE rn <= 1;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

   store_id                   product_name total_sales
0         1      Hazelnut Chocolate Spread     2494.00
1         2  Premium Blueberries Prepacked     2500.00

### 14.what is customer_id who spent the most each store?

In [16]:
stmt = """
SELECT store_id, customer_id, total_spent
FROM (
SELECT store_id, customer_id, SUM(total_price) AS total_spent,
RANK() OVER (PARTITION BY store_id ORDER BY SUM(total_price) DESC) AS rank
FROM customer_orders
GROUP BY store_id, customer_id
) subquery
WHERE rank = 1;
"""
# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

   store_id  customer_id total_spent
0         1          491     2494.00
1         2          621     2500.00

### 15. what are the top3 categories together bought by customers each store?

In [17]:
stmt = """
SELECT store_id, category1, category2, count
FROM (
SELECT s.store_id, c1.category_name AS category1, c2.category_name AS category2, COUNT(*) AS count,
ROW_NUMBER() OVER (PARTITION BY s.store_id ORDER BY COUNT(*) DESC) AS rn
FROM sales s
JOIN inventory i1 ON s.product_id = i1.product_id
JOIN inventory i2 ON s.product_id <> i2.product_id AND s.store_id = i2.store_id AND i1.category_id < i2.category_id AND i1.store_id = i2.store_id
JOIN product_categories c1 ON i1.category_id = c1.category_id
JOIN product_categories c2 ON i2.category_id = c2.category_id
GROUP BY s.store_id, c1.category_name, c2.category_name
) t
WHERE rn <= 3
ORDER BY store_id, count DESC;
"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

   store_id          category1              category2  count
0         1  Prepacked seafood              On the go    792
1         1  Prepacked seafood     Brie & soft cheese    660
2         1  Prepacked seafood  Smoked and cured fish    627
3         2  Prepacked seafood              On the go    836
4         2          On the go      Family favourites    722
5         2     Slices & Bites              On the go    608